<template>
  <header
    class="sticky top-0 p-5 bg-white"
    style="
      min-width: 500px;
      width: 100%;
      background-color: rgb(119, 0, 255);
      justify-content: center;
      height: 60px;
    "
  >
    <a href="#">
      <img src="../images/OUT.png" style="height: 30px; width: 30px; float: left" />
    </a>
    <center>
      <a style="font-family: cursive; color: white; margin-left: -2%px; font-size: 25px"
        >Химия</a
      >
    </center>
  </header>
  <main>
    <a
      style="
        color: rgb(0, 0, 0);
        font-size: 19px;
        font-family: 'Times New Roman', Times, serif;
      "
    >
      <div
        style="
          margin: 14%;
          margin-top: 10px;
          font-size: 20px;
          font-family: 'Times New Roman', Times, serif;
        "
      >
        <grid style="min-width: 400px; width: 80%">
          <div style="min-width: 400px">
            <div style="font-weight: bold; text-align: center; font-weight: bold">
              Основные правила:
            </div>
            <br />
            Для начала, поговорим о превых заданиях ОГЭ по Химии.<br />
            <center style="font-weight: bold">
              <br />
              Электронные уровни<br />
            </center>
            Это очень легкая тема. И я думаю, при желании, это и в школе можно понять и
            видос посмотреть. Оставляю ссылку на афигенного учителя химии.<br />
            <a href="https://www.youtube.com/watch?v=gxABFeULId4" style="color: blue"
              >Нажми на меня</a
            ><br />
            <br />А теперь пойдут темы в разнобой. Просто выпишите себе правила.<br /><br />
            <center style="font-weight: bold">Цвета осадков</center>
            <br />
            Ca,Mg,Be,Al,Zn,Pb-в основном, белые.<br />
            CaCO3;BaSO4-мелкокристалические<br />
            AgCl-Белый творожистый<br />
            Fe(OH)2-Серо-зеленный<br />
            Fe(OH)3-Бурый<br />
            Cu(OH)2-Голубой<br />
            Cu2O-Красный<br />
            AgBr-Бержевый<br />
            Ag2Cr2O7-Красный<br />
            BaCrO4-Желтый<br />
            BaSO3-Белый<br />
            AgI,Ag3PO4,PbI-Желтые т.к ёд<br />
            AgS,PbS2,CuS2,CuO,FeO-Черные<br />
            Cr2O3,Cr(OH)3-Зеленыe<br />
            Fe2O3,MnO2-Коричневый<br /><br />
            <center style="font-weight: bold">Классификация Гидроксидов</center>
            <br />
            1)Основные (Meталл^+1+2степень окисления)<br />
            NaOH<br />
            Ca(OH)2<br />
            2)Кислотные (Там, гдe есть буква H)<br />
            3)Амфотерные(Мет^+3+4)<br />
            Al(OH)3<br />
            Zn(OH)2<br />
            <center style="font-weight: bold">Классификация Оксидов</center>
            <br />
            1)Основные (Meт^+1+2степень окисления)<br />
            NaOH<br />
            Ca(OH)2<br />
            2)Кислотные (Там, гдe есть буква H)<br />
            3)Амфотерные(Мет^+3+4)<br />
            Al(OH)3<br />
            Zn(OH)2<br />
            <center style="font-weight: bold">Теория</center>
            На 2 месте > электроотрицательные элементы .<br />
            Катод + Анод-. Диссациация распад вещества на ионы при растворении.<br />
            Неэлектролиты- оксиды.<br />
            Сильные электролиты- соли, основания кроме (NH4OH) и HCL,HBr.HI,<br />KClO3,H2SO4,HNO3.<br />
            Слабые- остальные. <br />
            <center style="font-weight: bold">Задания по таблице Менделеева</center>

            Заряд ядра больше чем ниже и правее элемент.<br />
            Число заполненных энергетических уровней тем больше чем ниже элемент<br />
            Число электронов на внешнем уровне тем больше, чем правее в
            табл.Менделеева.<br />
            R атома чем ниже, тем больше.Чем правее, тем меньше.<br />
            Восстановительные свойства чем ниже в таблице тем больше.Чем правее, тем
            меньше.<br />
            Окислительные свойства Чем ниже, тем меньше. Чем правее, тем бльше.<br />
            Высшая степень окисления увеличивается направо.<br />
            Металлические свойства тем больше, чем ниже и правее элемент.<br />
            Немет свойства наоборот.<br />

            <center style="font-weight: bold">Задания на в-ва</center>
            <br />
            Химический элемент- составная часть сложного вещества. <br />
            Простое вещество- S,Mg и т.д смешивают с чем -то. <br />
            Химическое вещество - что- то из чего- то получается.<br />
            <center style="font-weight: bold">Связи</center>
            Ионная связь это мет + немет. <br />
            Коваленты связь- с неметаллами только:<br />
            1)Неполярная-1 элемент(N2,Na)<br />
            2)Полярная->1 элемента.<br />
            Метал связь- простое в -во металл.<br />
            Химическая связь-связывает атомы.<br />
            <center style="font-weight: bold">Решетки</center>
            Ионная кр. решетка у солей, оксидов, гидроксидов металла.<br />
            Атомная кр. реш:C,B,Si,Al2O3,SiO2.<br />
            Молекулярная: O2,H2,Cl2,N2,Br2,H2O,CO2,KCl,S3 P4 I2<br />
            Металлическая: металлы, сплавы.<br />
            <center style="font-weight: bold">Доп инфа</center>
            Двухатомные элементы: N2,O2,F2,Cl2,<br />H2,Br2,I2.<br />
            Трехатомные: O3.<br />
            <center style="font-weight: bold">Оксиды</center>
            Cолеобразующие оксиды: С металлами.<br />
            Неcолеобразующие: Со, NO, NO2. <br />
            <center style="font-weight: bold">Реакции</center>
            Экзатермич реакция- выделение тепла.<br />
            Эндотермическая -поглощение тепла. <br />
            Реакция нейтрализации: основание + кислота= соль + вода.<br />
            Реакция ионного обмена: сокращение элементов.<br />
            <center style="font-weight: bold">Справка</center>
            Нейтроны=массе элемента- количество протонов.<br />
            Протоны= электронам= номеру элемента.<br />
            <center style="font-weight: bold">
              Степени окисления некоторых элементов по умолчанию
            </center>
            O^-2,K^+1,Na^+1,H^+1,Be^2.<br />
            <center style="font-weight: bold">Нестабильные кислоты</center>
            H2CO3<br />
            H2SO3<br />
            <center style="font-weight: bold">Задачи на моли. Примеры решения</center>
            <img src="C:/Users/Root/oge/src/images/н.jpg" /><br />
            <center style="font-weight: bold">Формулы из задач(через МОЛИ).</center>
            n(кол-во в-ва)=m(масса)/M(Молярная масса(сумма из табл.менделеева))<br />
            n=V(Обьем)/Vm(22.4 или молярный обьем).<br />
            Vm=V/n<br />
            W(массовая доля в-ва)=mв-ва/mр-ра*100<br />
            mв-ва+mр-ля=mр-ра<br />
            mв-ва=W*mр-ра/100<br />
            В чем измеряется<br />
            n(моль)<br />
            M(гр/моль)<br />
            V(л)<br />
            Vm(л/моль)<br /><br />
            <center><img src="C:/Users/Root/oge/src/images/Kisl.jpg" /></center>
            <br /><br />
            <center style="font-weight: bold">
              Химические свойства основных классов неорганических соеденений
            </center>
            1)Реакции обмена<br />
            1.Оксид мет+ кислота=соль+вода<br />
            2.Основание+кислота=<br />соль+вода<br />
            3.Соль+кислота=соль+<br />кислота новая. Условие:образование осадка <br />
            4.Соль1+соль2=соль3+соль4. Условие:образование осадка<br />
            5.Соль+щелочь=соль+<br />нераствор.основание. <br />
            Условие:образование осадка<br />
            6.Щелочь+оксид неметалла=соль+вода<br />
            7.Вода+оксид металла=основание.<br />
            8.Амфотерный оксид+кислота=соль+вода<br />
            9.Амотерный оксид+основный оксид=соль<br />
            10.Кислотный оксид+щелочь=соль+вода<br />
            11.кисл.оксид+щелочь=соль и вода.<br />
            2)Реакции замещения<br />
            1.Мет+кислота=соль+водород Условие-метал до Н в табл. Активности.<br />
            2.Соль+мет=соль+мет Условие-металл активнее металла в соли.<br />
            3)Соеденения<br />
            1.Основный оксид+вода=щелочь Условие-в реакцию вступают оксиды щел и
            щел-земельных металлов.<br />
            2.Кислотный оксид+вода=кислота (кроме Sio2)<br />
            3.Мет+неметалл=соль<br />
            4)Разложения<br />
            1.Нерастворимые основания=оксид мет+вода. Условие: температура<br />
            2.Соль=оксид мет+оксид немет. Условие:Температура<br />
            3.Нестабильная кислота=кислотный оксид+вода<br />
            Вот ОСНОВНЫЕ формулы, которые нужно знать. Также вам будут встречаться примеры
            с концентрированными и неконцентрированными, разбавленными и неразбавленными
            в-ми. Эти моменты я не выписывал. Т.к важно знать самое главное. А то не очень
            важно. Оно вряд ли встретится на экзамене. Мне не встретилось. Но все же суть
            там надо понять на всякий случай.<br />
            <img src="C:/Users/Root/oge/src/images/Color.png" />
          </div>
        </grid>
      </div>
    </a>
  </main>
</template>
<style>
* {
  color: #cccccc;
}
</style>
<script setup>
import { onMounted } from "vue";

function handleKeydown(event) {
  if (event.key === "Escape") {
    window.location.href = "#";
  }
}

onMounted(() => {
  document.addEventListener("keydown", handleKeydown);
});
</script>
