<template>
  <header
    class="sticky top-0 p-5 bg-white"
    style="
      min-width: 500px;
      width: 100%;
      background-color: rgb(119, 0, 255);
      justify-content: center;
      height: 60px;
    "
  >
    <a href="#">
      <img src="../images/OUT.png" style="height: 30px; width: 30px; float: left" />
    </a>
    <center>
      <a style="font-family: cursive; color: white; font-size: 25px; margin-left: -1.5%"
        >Русский язык</a
      >
    </center>
  </header>
  <main>
    <a
      style="
        color: rgb(0, 0, 0);
        font-size: 19px;
        font-family: 'Times New Roman', Times, serif;
      "
    >
      <div
        style="
          margin: 14%;
          margin-top: 10px;
          font-size: 20px;
          font-family: 'Times New Roman', Times, serif;
        "
      >
        <grid style="min-width: 400px; width: 80%">
          <div style="min-width: 400px">
            <center style="font-weight: bold">Средства выразительности</center>
            Признаки фразеологизма:<br />
            Смысл не объясним если попытаться по-отдельности понять слова. Его можно
            заменить 1 словом. Имеет преносный смысл. Олицетворение – пренос живых св-в на
            неживые ( за окном выл ветер)-ветер не может выть. Воют только живые сущ-ва.
            <br />Сравнение есть когда: <br />1)Есть слово “как” (как капля) <br />2)Есть
            сравнительная степень прилагательных (кожа БЕЛЕЕ горных снегов) <br />3)Есть
            слова подобный, похожий. <br />4) В предложении используется Т.п (отвечает на
            вопросы кем? Чем?) <br /><br />
            <center style="font-weight: bold">Метафора</center>
            Метафора-скрытое сравнение (Серп луны. Можно переделать в предложение: серп
            как у луны, а это- сравнение). <br /><br />
            <center style="font-weight: bold">Эпитет</center>
            Эпитет- художественное ЯРКОЕ определение (есть прилагательное). Пример:
            изумрудная зелень. <br /><br />
            <center style="font-weight: bold">Подчинительная связь</center>
            Тут все очень просто.<br />
            Согласование- вопрос от слова к другому слову Какой? Какая? Какое? Какие?<br />
            Управление- отвечает на вопросы косвенных падежей (Всех кроме и.п)<br />
            Примыкание-зависимое слово отвечает на вопросы наречия, деепричастия,
            инфинитива.<br />
            <br />
            <center style="font-weight: bold">Виды сказуемых:</center>
            <br />
            ПГС: 1 глагол в словосочетании<br />
            СГС:2 какое-то слово+ инфинитив<br />
            CИС: глагол-связка + именная часть (можно в инете найти что это) <br />
            <br />
            <center style="font-weight: bold">Обособленное обстоятельство</center>
            Обособленное обстоятельство- деепричастие (что делая? Что сделав?).<br />
            <br />
            <center style="font-weight: bold">Структурно-неполное предложение</center>
            <br />Структурно-неполное предложение- пропущено либо подлежащее, либо
            сказуемое, либо и то, и то.<br />
            <br />
            <center style="font-weight: bold">Простое предложение</center>
            Простое предложение- не содержащее ссп и спп. Она состоит из 1 грамматической
            основы и иногда второстепенных членов предложения.<br />
            <br />
            <center style="font-weight: bold">Вводные слова</center>
            Вводные слова можно найти в инете. Там есть табличка. Их надо просто
            запомнить. Они выделяются с 2 сторон запятыми всегда!<br />
            <br />
            <center style="font-weight: bold">Сложные предложения</center>
            ССП- предложение с сочинительными союзами. Перед сочин. союзами всегда
            ставится запятая если предложение сложное.<br />
            СПП-предложение с подчинительными союзами. Также, можно задать вопрос от 1 гл.
            части предложения ко 2 (то, что после запятой). <br />Не стоит путать сложное
            предложение с предложением с однородными членами (это предложение где есть
            пречисление через запятую, но нет 2 грамматической основы. <br />
            <center style="font-weight: bold">Грамматическая основа</center>
            Грамматическая основа- подлежащее+сказуемое. <br />В грамматическую основу не
            входят дополнения, определения и обстоятельства. Это второстепенные члены. На
            какие вопросы они отвечают, можно найти в инете. <br />
            <center style="font-weight: bold">Приложение</center>
            Приложение- 2 название слова . (Дочь Ирины Анатольевны, Ксения, была очень
            красива. Это приложение т.к дочь Ирины Анатольевны и есть Ксения.)<br />
            <br />
            <center style="font-weight: bold">Виды подчинения</center>
            <center>
              <img src="../images/uzo.jpg" style="width: 760px" />
            </center>
            <br />
            <center style="font-weight: bold">Относительные местоимения</center>
            Относительные местоимения: кто, что, какой, чей, который, сколько, каков. Есть
            еще, но они мне не пригодились на экзамене.<br />
            <br />
            <center style="font-weight: bold">Разговорная лексика</center>
            Разговорная лексика (хай, пацаны).<br />
            <br />
            <center style="font-weight: bold">Прямая речь</center>
            Прямая речь- высказывания, дословно введенные автором в текст. Выделяются
            кавычками.<br />
            <br />
            <center style="font-weight: bold">Однородные сказуемые</center>
            Однородные сказуемые- 2 и > глагола, которые относятся к 1 и тому же
            подлежащему.<br />
            <br />
            <center style="font-weight: bold">Просторечивые слова</center>
            Просторечивые слова: айда, авось, внатуре и т.д <br />
            <br />
            <center style="font-weight: bold">Двоеточие</center>
            Двоеточие ставится когда можно ввести в текст без потери смысла союзы: так
            как, как, а именно.<br />
            <br />
            <center style="font-weight: bold">Тире</center>
            Тире, когда союзы: а, когда, если, так что и если происходит быстрая смена
            обстоятельств.<br />
            <br />
            <center style="font-weight: bold">О экзамене</center>
            Также, на экзамене необходимо знать: спряжения глаголов, глсные и согласные
            буквы, лица, чередование согл и склонение существительных. Это все можно найти
            в инете в картинках.<br />
            <br />
            <center style="font-weight: bold">
              Н/НН<br /><img src="../images/Nn.jpg" />
            </center>
            <br />
            <center style="font-weight: bold">Распространенное предложение</center>
            <br />Распространенное предложение- гл члены предложения+ второстепенные.<br />
            <br />
            <center style="font-weight: bold">Нераспространенные</center>
            Нераспространенные- чисто главные члены предложения.<br />
            <br />
            <center style="font-weight: bold">Стили</center>
            Публицистический- стиль средств массовой информации Разговорный- стиль
            повседневного общения Научный – сообщение научных рез-в и просвещение
            Официально деловой- стиль документов, договоров, законов и т.д Художественный-
            роман, повесть, рассказ.<br />

            <br />
            <center style="font-weight: bold">Не/Ни</center>
            Не пишется когда отрицание или в восклиц предложениях.<br />
            Ни-усиление отрицания, усиление утверждения и перед буквой и.<br />
            <br />
            <center style="font-weight: bold">Побудительное предложение</center>
            Побудительное предложение- приказы.<br /><br />
            Это все, но хочу отметить, что тут не было не с разными частями речи. Я где-то
            потерял эти правила. Ну и их формулировка была достаточно сложной для учения.
            Вот с помощью этих правил, я и готовился к экзамену. Надеюсь, вам понравился
            сайт. Можете, если хотите, перейти на другие предметы и просмотреть всю
            концентрированную теорию по ним. Спасибо, что зашли!<br />
            P.S Словосочетание “если хотите” , тоже является вводным словом.
          </div>
        </grid>
      </div>
    </a>
  </main>
</template>
<style>
* {
  color: #cccccc;
}
</style>
<script setup>
import { onMounted } from "vue";

function handleKeydown(event) {
  if (event.key === "Escape") {
    window.location.href = "#";
  }
}

onMounted(() => {
  document.addEventListener("keydown", handleKeydown);
});
</script>
